Some more intro to Pandas

Loading data into pandas dataframe

The MovieLens data

http://grouplens.org/datasets/movielens/

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Loading the user data.

In [2]:
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']

users = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.user', names = u_cols)

In [3]:
users.head()

                   user_id  age  sex  occupation  zip_code
0  1|24|M|technician|85711  NaN  NaN         NaN       NaN
1       2|53|F|other|94043  NaN  NaN         NaN       NaN
2      3|23|M|writer|32067  NaN  NaN         NaN       NaN
3  4|24|M|technician|43537  NaN  NaN         NaN       NaN
4       5|33|F|other|15213  NaN  NaN         NaN       NaN

We need to use the `sep = |`

In [4]:
users = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.user', names = u_cols, sep = '|')

In [5]:
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

Loading the ratings data.

In [6]:
r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']

ratings = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.data', sep = '\t', names = r_cols)

In [7]:
ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

Loading the movies data.

In [8]:
# the movies file contains columns indicating the movie's genres
# let's only load the first five columns of the file with usecols

m_cols = ['movie_id', 'title', 'release_date', 
            'video_release_date', 'imdb_url']

# movies = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.item', names = m_cols,
#                     sep = '|', usecols = range(5))

movies = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.item', 
    sep='|', names=m_cols, usecols=range(5), encoding = "ISO-8859-1")

In [9]:
movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

Get the inforformation about our data.

In [10]:
movies.dtypes

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object

In [11]:
movies.describe()

          movie_id  video_release_date
count  1682.000000                 0.0
mean    841.500000                 NaN
std     485.695893                 NaN
min       1.000000                 NaN
25%     421.250000                 NaN
50%     841.500000                 NaN
75%    1261.750000                 NaN
max    1682.000000                 NaN

In [12]:
movies.isnull().sum()

movie_id                 0
title                    0
release_date             1
video_release_date    1682
imdb_url                 3
dtype: int64

Quiz 1

- Show users aged 40 and male
- show mean age of female programmers

Answer 1

In [13]:
users[(users['sex'] == 'M') & (users['age'] == 40)]

     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232
199      200   40   M  programmer    93402
283      284   40   M   executive    92629
289      290   40   M    engineer    93550
308      309   40   M   scientist    70802
357      358   40   M    educator    10022
397      398   40   M       other    60008
564      565   40   M     student    55422
646      647   40   M    educator    45810
791      792   40   M  programmer    12205
841      842   40   M      writer    93055
917      918   40   M   scientist    70116

Answer 2

In [14]:
mean_age_female_programmer = (users[(users['sex'] == 'F') & (users['occupation'] == 'programmer')])['age'].mean()

print(f"The mean age of female programmer is {mean_age_female_programmer}")

The mean age of female programmer is 32.166666666666664

Split-apply-combine

<img src=http://i.imgur.com/yjNkiwL.png></img>

Find Diligent Users

- split data per user ID
- count ratings
- combine result

In [15]:
ratings.groupby('user_id')['rating'].count().reset_index().sort_values(['rating'],ascending = False).head(10)

     user_id  rating
404      405     737
654      655     685
12        13     636
449      450     540
275      276     518
415      416     493
536      537     490
302      303     484
233      234     480
392      393     448

Quiz 2


- get the average rating per movie
- advanced: get the movie titles with the highest average rating

Answer 1

In [16]:
ratings.groupby('movie_id').mean().sort_values(['rating'], ascending = False).max()

user_id                 916.0
rating                    5.0
unix_timestamp    893164030.0
dtype: float64

Answer 2

Getting just the highest rated movies is questionable, but we will just use it in this demonstration.

In [17]:
high_rated_movies = ratings[ratings['rating'] == 5]

In [18]:
high_rated_movies.head()

    user_id  movie_id  rating  unix_timestamp
7       253       465       5       891628467
11      286      1014       5       879781125
12      200       222       5       876042340
16      122       387       5       879270459
26       38        95       5       892430094

In [19]:
(movies[movies['movie_id'].isin(high_rated_movies['movie_id'])]['title']).head()

0     Toy Story (1995)
1     GoldenEye (1995)
2    Four Rooms (1995)
3    Get Shorty (1995)
4       Copycat (1995)
Name: title, dtype: object

Passing a Function in apply.

In [20]:
average_ratings = ratings.groupby('user_id').apply(lambda f: f.mean())

average_ratings.head()

         user_id    movie_id    rating  unix_timestamp
user_id
1            1.0  136.500000  3.610294    8.773916e+08
2            2.0  249.500000  3.709677    8.886204e+08
3            3.0  318.814815  2.796296    8.892372e+08
4            4.0  291.041667  4.333333    8.920028e+08
5            5.0  291.291429  2.874286    8.762081e+08